application/controllers/admin/paypalrefund/PayPal.log

PPAPIService: Request: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn:ebay:api:PayPalAPI" xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:ed="urn:ebay:apis:EnhancedDataTypes" ><soapenv:Header><ns:RequesterCredentials><ebl:Credentials><ebl:Username>parwinder.singh_api1.a1professionals.info</ebl:Username><ebl:Password>MFMDFEEE9KGXXZQF</ebl:Password><ebl:Signature>AFcWxV21C7fd0v3bYYYRCpSSRl31AUNG-F7Mbr8SGYKa0YwBurBuZ7rQ</ebl:Signature></ebl:Credentials></ns:RequesterCredentials></soapenv:Header><soapenv:Body><ns:GetTransactionDetailsReq><ns:GetTransactionDetailsRequest><ns:TransactionID>4JW3243488758161N</ns:TransactionID><ebl:Version>117.0</ebl:Version></ns:GetTransactionDetailsRequest></ns:GetTransactionDetailsReq></soapenv:Body></soapenv:Envelope>
PPHttpConnection: Connecting to https://api-3t.sandbox.paypal.com/2.0
PPHttpConnection: Payload <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn:ebay:api:PayPalAPI" xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:ed="urn:ebay:apis:EnhancedDataTypes" ><soapenv:Header><ns:RequesterCredentials><ebl:Credentials><ebl:Username>parwinder.singh_api1.a1professionals.info</ebl:Username><ebl:Password>MFMDFEEE9KGXXZQF</ebl:Password><ebl:Signature>AFcWxV21C7fd0v3bYYYRCpSSRl31AUNG-F7Mbr8SGYKa0YwBurBuZ7rQ</ebl:Signature></ebl:Credentials></ns:RequesterCredentials></soapenv:Header><soapenv:Body><ns:GetTransactionDetailsReq><ns:GetTransactionDetailsRequest><ns:TransactionID>4JW3243488758161N</ns:TransactionID><ebl:Version>117.0</ebl:Version></ns:GetTransactionDetailsRequest></ns:GetTransactionDetailsReq></soapenv:Body></soapenv:Envelope>
PPHttpConnection: Adding header X-PAYPAL-REQUEST-DATA-FORMAT: SOAP
PPHttpConnection: Adding header X-PAYPAL-RESPONSE-DATA-FORMAT: SOAP
PPHttpConnection: Adding header X-PAYPAL-DEVICE-IPADDRESS: ::1
PPHttpConnection: Adding header X-PAYPAL-REQUEST-SOURCE: merchant-sdk-php-2.11.118
PPHttpConnection: Adding header User-Agent: PayPalSDK/merchant-sdk-php 2.11.118 (lang=PHP;v=5.6.3;bit=32;os=Windows_NT_6.1;machine=i586;openssl=1.0.1i;curl=7.39.0)
PPHttpConnection: Invalid or no certificate authority found - Retrying using bundled CA certs file
PPAPIService: Response: <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ed="urn:ebay:apis:EnhancedDataTypes" xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:ns="urn:ebay:api:PayPalAPI"><SOAP-ENV:Header><Security xmlns="http://schemas.xmlsoap.org/ws/2002/12/secext" xsi:type="wsse:SecurityType"></Security><RequesterCredentials xmlns="urn:ebay:api:PayPalAPI" xsi:type="ebl:CustomSecurityHeaderType"><Credentials xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="ebl:UserIdPasswordType"><Username xsi:type="xs:string"></Username><Password xsi:type="xs:string"></Password><Signature xsi:type="xs:string"></Signature><Subject xsi:type="xs:string"></Subject></Credentials></RequesterCredentials></SOAP-ENV:Header><SOAP-ENV:Body id="_0"><GetTransactionDetailsResponse xmlns="urn:ebay:api:PayPalAPI"><Timestamp xmlns="urn:ebay:apis:eBLBaseComponents">2017-05-19T07:01:05Z</Timestamp><Ack xmlns="urn:ebay:apis:eBLBaseComponents">Success</Ack><CorrelationID xmlns="urn:ebay:apis:eBLBaseComponents">4c4f0964558e0</CorrelationID><Version xmlns="urn:ebay:apis:eBLBaseComponents">117.0</Version><Build xmlns="urn:ebay:apis:eBLBaseComponents">25237094</Build><PaymentTransactionDetails xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="ebl:PaymentTransactionType"><ReceiverInfo xsi:type="ebl:ReceiverInfoType"><Business xsi:type="ebl:EmailAddressType">parwinder.singh@a1professionals.info</Business><Receiver xsi:type="ebl:EmailAddressType">parwinder.singh@a1professionals.info</Receiver><ReceiverID xsi:type="ebl:UserIDType">7JWZD86VJB9XJ</ReceiverID></ReceiverInfo><PayerInfo xsi:type="ebl:PayerInfoType"><Payer xsi:type="ebl:EmailAddressType">harish.chander@a1professionals.info</Payer><PayerID xsi:type="ebl:UserIDType">QVTHTNGMNQFDE</PayerID><PayerStatus xsi:type="ebl:PayPalUserStatusCodeType">unverified</PayerStatus><PayerName xsi:type="ebl:PersonNameType"><Salutation xmlns="urn:ebay:apis:eBLBaseComponents"></Salutation><FirstName xmlns="urn:ebay:apis:eBLBaseComponents">vbvbvb</FirstName><MiddleName xmlns="urn:ebay:apis:eBLBaseComponents"></MiddleName><LastName xmlns="urn:ebay:apis:eBLBaseComponents">bvbvbv</LastName><Suffix xmlns="urn:ebay:apis:eBLBaseComponents"></Suffix></PayerName><PayerCountry xsi:type="ebl:CountryCodeType">US</PayerCountry><PayerBusiness xsi:type="xs:string">bvvbvvb</PayerBusiness><Address xsi:type="ebl:AddressType"><Name xsi:type="xs:string"></Name><Street1 xsi:type="xs:string"></Street1><Street2 xsi:type="xs:string"></Street2><CityName xsi:type="xs:string"></CityName><StateOrProvince xsi:type="xs:string"></StateOrProvince><CountryName></CountryName><PostalCode xsi:type="xs:string"></PostalCode><AddressOwner xsi:type="ebl:AddressOwnerCodeType">PayPal</AddressOwner><AddressStatus xsi:type="ebl:AddressStatusCodeType">Unconfirmed</AddressStatus></Address><ContactPhone xsi:type="xs:string"></ContactPhone></PayerInfo><TPLReferenceID xsi:type="xs:string"></TPLReferenceID><PaymentInfo xsi:type="ebl:PaymentInfoType"><TransactionID>4JW3243488758161N</TransactionID><ParentTransactionID xsi:type="ebl:TransactionId"></ParentTransactionID><ReceiptID></ReceiptID><TransactionType xsi:type="ebl:PaymentTransactionCodeType">cart</TransactionType><PaymentType xsi:type="ebl:PaymentCodeType">instant</PaymentType><PaymentDate xsi:type="xs:dateTime">2017-05-19T06:54:53Z</PaymentDate><GrossAmount xsi:type="cc:BasicAmountType" currencyID="USD">344.00</GrossAmount><FeeAmount xsi:type="cc:BasicAmountType" currencyID="USD">10.28</FeeAmount><TaxAmount xsi:type="cc:BasicAmountType" currencyID="USD">0.00</TaxAmount><ExchangeRate xsi:type="xs:string"></ExchangeRate><PaymentStatus xsi:type="ebl:PaymentStatusCodeType">Refunded</PaymentStatus><PendingReason xsi:type="ebl:PendingStatusCodeType">none</PendingReason><ReasonCode xsi:type="ebl:ReversalReasonCodeType">refund</ReasonCode><ShippingMethod xsi:type="xs:string">Default</ShippingMethod><ProtectionEligibility xsi:type="xs:string">Eligible</ProtectionEligibility><ProtectionEligibilityType xsi:type="xs:string">ItemNotReceivedEligible,UnauthorizedPaymentEligible</ProtectionEligibilityType><ShipAmount xsi:type="xs:string">0.00</ShipAmount><ShipHandleAmount xsi:type="xs:string">0.00</ShipHandleAmount><ShipDiscount xsi:type="xs:string"></ShipDiscount><InsuranceAmount xsi:type="xs:string">0.00</InsuranceAmount><Subject xsi:type="xs:string"></Subject><ReceiptReferenceNumber xsi:type="xs:string"></ReceiptReferenceNumber><POSTransactionType xsi:type="xs:string"></POSTransactionType><StoreID xsi:type="xs:string"></StoreID><TerminalID xsi:type="xs:string"></TerminalID><BinEligibility xsi:type="xs:string"></BinEligibility></PaymentInfo><PaymentItemInfo xsi:type="ebl:PaymentItemInfoType"><InvoiceID xsi:type="xs:string"></InvoiceID><Custom xsi:type="xs:string"></Custom><Memo xsi:type="xs:string"></Memo><SalesTax xsi:type="xs:string">0.00</SalesTax><PaymentItem xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="ebl:PaymentItemType"><EbayItemTxnId xsi:type="xs:string"></EbayItemTxnId><Name xsi:type="xs:string">dummy</Name><Number xsi:type="xs:string">55</Number><Quantity xsi:type="xs:string">1</Quantity><SalesTax xsi:type="xs:string">0.00</SalesTax><ShippingAmount xsi:type="xs:string">0.00</ShippingAmount><HandlingAmount xsi:type="xs:string">0.00</HandlingAmount><CouponID xsi:type="xs:string"></CouponID><CouponAmount xsi:type="xs:string"></CouponAmount><CouponAmountCurrency xsi:type="xs:string"></CouponAmountCurrency><LoyaltyCardDiscountAmount xsi:type="xs:string"></LoyaltyCardDiscountAmount><LoyaltyCardDiscountCurrency xsi:type="xs:string"></LoyaltyCardDiscountCurrency><InvoiceItem xsi:type="ebl:InvoiceItemType"><ItemCountUnit xsi:type="ebl:UnitOfMeasure"></ItemCountUnit><Taxable xsi:type="xs:string">false</Taxable><TaxRate xsi:type="xs:string">0.0</TaxRate><MPN xsi:type="xs:string"></MPN><ISBN xsi:type="xs:string"></ISBN><PLU xsi:type="xs:string"></PLU><ModelNumber xsi:type="xs:string"></ModelNumber><StyleNumber xsi:type="xs:string"></StyleNumber></InvoiceItem><Amount xsi:type="cc:BasicAmountType" currencyID="USD">344.00</Amount></PaymentItem><Subscription xsi:type="ebl:SubscriptionInfoType" recurring="" reattempt=""><SubscriptionID></SubscriptionID><Username xsi:type="xs:string"></Username><Password xsi:type="xs:string"></Password><Recurrences xsi:type="xs:string"></Recurrences></Subscription><Auction xsi:type="ebl:AuctionInfoType" multiItem=""><BuyerID xsi:type="xs:string"></BuyerID></Auction></PaymentItemInfo><OfferCouponInfo xsi:type="ebl:OfferCouponInfoType"><Type xsi:type="xs:string"></Type><ID xsi:type="xs:string"></ID><Amount xsi:type="xs:string"></Amount><AmountCurrency xsi:type="xs:string"></AmountCurrency></OfferCouponInfo><GiftReceipt xsi:type="xs:string">0</GiftReceipt></PaymentTransactionDetails></GetTransactionDetailsResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
PPAPIService: Request: <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn:ebay:api:PayPalAPI" xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:ed="urn:ebay:apis:EnhancedDataTypes" ><soapenv:Header><ns:RequesterCredentials><ebl:Credentials><ebl:Username>parwinder.singh_api1.a1professionals.info</ebl:Username><ebl:Password>MFMDFEEE9KGXXZQF</ebl:Password><ebl:Signature>AFcWxV21C7fd0v3bYYYRCpSSRl31AUNG-F7Mbr8SGYKa0YwBurBuZ7rQ</ebl:Signature></ebl:Credentials></ns:RequesterCredentials></soapenv:Header><soapenv:Body><ns:RefundTransactionReq><ns:RefundTransactionRequest><ns:TransactionID>4JW3243488758161N</ns:TransactionID><ns:RefundType>Full</ns:RefundType><ns:RefundSource>any</ns:RefundSource><ebl:Version>117.0</ebl:Version></ns:RefundTransactionRequest></ns:RefundTransactionReq></soapenv:Body></soapenv:Envelope>
PPHttpConnection: Connecting to https://api-3t.sandbox.paypal.com/2.0
PPHttpConnection: Payload <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="urn:ebay:api:PayPalAPI" xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:ed="urn:ebay:apis:EnhancedDataTypes" ><soapenv:Header><ns:RequesterCredentials><ebl:Credentials><ebl:Username>parwinder.singh_api1.a1professionals.info</ebl:Username><ebl:Password>MFMDFEEE9KGXXZQF</ebl:Password><ebl:Signature>AFcWxV21C7fd0v3bYYYRCpSSRl31AUNG-F7Mbr8SGYKa0YwBurBuZ7rQ</ebl:Signature></ebl:Credentials></ns:RequesterCredentials></soapenv:Header><soapenv:Body><ns:RefundTransactionReq><ns:RefundTransactionRequest><ns:TransactionID>4JW3243488758161N</ns:TransactionID><ns:RefundType>Full</ns:RefundType><ns:RefundSource>any</ns:RefundSource><ebl:Version>117.0</ebl:Version></ns:RefundTransactionRequest></ns:RefundTransactionReq></soapenv:Body></soapenv:Envelope>
PPHttpConnection: Adding header X-PAYPAL-REQUEST-DATA-FORMAT: SOAP
PPHttpConnection: Adding header X-PAYPAL-RESPONSE-DATA-FORMAT: SOAP
PPHttpConnection: Adding header X-PAYPAL-DEVICE-IPADDRESS: ::1
PPHttpConnection: Adding header X-PAYPAL-REQUEST-SOURCE: merchant-sdk-php-2.11.118
PPHttpConnection: Adding header User-Agent: PayPalSDK/merchant-sdk-php 2.11.118 (lang=PHP;v=5.6.3;bit=32;os=Windows_NT_6.1;machine=i586;openssl=1.0.1i;curl=7.39.0)
PPHttpConnection: Invalid or no certificate authority found - Retrying using bundled CA certs file
PPAPIService: Response: <?xml version="1.0" encoding="UTF-8"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:cc="urn:ebay:apis:CoreComponentTypes" xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility" xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/12/secext" xmlns:ed="urn:ebay:apis:EnhancedDataTypes" xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:ns="urn:ebay:api:PayPalAPI"><SOAP-ENV:Header><Security xmlns="http://schemas.xmlsoap.org/ws/2002/12/secext" xsi:type="wsse:SecurityType"></Security><RequesterCredentials xmlns="urn:ebay:api:PayPalAPI" xsi:type="ebl:CustomSecurityHeaderType"><Credentials xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="ebl:UserIdPasswordType"><Username xsi:type="xs:string"></Username><Password xsi:type="xs:string"></Password><Signature xsi:type="xs:string"></Signature><Subject xsi:type="xs:string"></Subject></Credentials></RequesterCredentials></SOAP-ENV:Header><SOAP-ENV:Body id="_0"><RefundTransactionResponse xmlns="urn:ebay:api:PayPalAPI"><Timestamp xmlns="urn:ebay:apis:eBLBaseComponents">2017-05-19T07:01:13Z</Timestamp><Ack xmlns="urn:ebay:apis:eBLBaseComponents">Failure</Ack><CorrelationID xmlns="urn:ebay:apis:eBLBaseComponents">47f5b631aaec2</CorrelationID><Errors xmlns="urn:ebay:apis:eBLBaseComponents" xsi:type="ebl:ErrorType"><ShortMessage xsi:type="xs:string">Transaction refused</ShortMessage><LongMessage xsi:type="xs:string">This transaction has already been fully refunded</LongMessage><ErrorCode xsi:type="xs:token">10009</ErrorCode><SeverityCode xmlns="urn:ebay:apis:eBLBaseComponents">Error</SeverityCode></Errors><Version xmlns="urn:ebay:apis:eBLBaseComponents">117.0</Version><Build xmlns="urn:ebay:apis:eBLBaseComponents">000000</Build><RefundTransactionID></RefundTransactionID></RefundTransactionResponse></SOAP-ENV:Body></SOAP-ENV:Envelope>
